{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Asthma Plant.zip",
    "1": "Avaram.zip",
    "10": "Common Wireweed.zip",
    "11": "Country Mallow.zip",
    "12": "Crown flower.zip",
    "13": "Green Chireta.zip",
    "14": "Holy Basil.zip",
    "15": "Indian CopperLeaf.zip",
    "16": "Indian Jujube.zip",
    "17": "Indian Sarsaparilla.zip",
    "18": "Indian Stinging Nettle.zip",
    "19": "Indian Thornapple.zip",
    "2": "Balloon vine.zip",
    "20": "Indian wormwood.zip",
    "21": "Ivy Gourd.zip",
    "22": "Kokilaksha.zip",
    "23": "Land Caltrops (Bindii).zip",
    "24": "Madagascar Periwinkle.zip",
    "25": "Madras Pea Pumpkin.zip",
    "26": "Malabar Catmint.zip",
    "27": "Mexican Mint.zip",
    "28": "Mexican Prickly Poppy.zip",
    "29": "Mountain Knotgrass.zip",
    "3": "Bellyache bush (Green).zip",
    "30": "Nalta Jute.zip",
    "31": "Night blooming Cereus.zip",
    "32": "Panicled Foldwing.zip",
    "33": "Prickly Chaff Flower.zip",
    "34": "Punarnava.zip",
    "35": "Purple Fruited Pea Eggplant.zip",
    "36": "Purple Tephrosia.zip",
    "37": "Rosary Pea.zip",
    "38": "Shaggy button weed.zip",
    "39": "Small Water Clover.zip",
    "4": "Benghal dayflower.zip",
    "40": "Spiderwisp.zip",
    "41": "Square Stalked Vine.zip",
    "42": "Stinking Passionflower.zip",
    "43": "Sweet Basil.zip",
    "44": "Sweet flag.zip",
    "45": "Tinnevelly Senna.zip",
    "46": "Trellis Vine.zip",
    "47": "Velvet bean.zip",
    "48": "coatbuttons.zip",
    "49": "heart-leaved moonseed.zip",
    "5": "Big Caltrops.zip",
    "6": "Black-Honey Shrub.zip",
    "7": "Bristly Wild Grape.zip",
    "8": "Butterfly Pea.zip",
    "9": "Cape Gooseberry.zip"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Asthma Plant.zip": "0",
    "Avaram.zip": "1",
    "Balloon vine.zip": "2",
    "Bellyache bush (Green).zip": "3",
    "Benghal dayflower.zip": "4",
    "Big Caltrops.zip": "5",
    "Black-Honey Shrub.zip": "6",
    "Bristly Wild Grape.zip": "7",
    "Butterfly Pea.zip": "8",
    "Cape Gooseberry.zip": "9",
    "Common Wireweed.zip": "10",
    "Country Mallow.zip": "11",
    "Crown flower.zip": "12",
    "Green Chireta.zip": "13",
    "Holy Basil.zip": "14",
    "Indian CopperLeaf.zip": "15",
    "Indian Jujube.zip": "16",
    "Indian Sarsaparilla.zip": "17",
    "Indian Stinging Nettle.zip": "18",
    "Indian Thornapple.zip": "19",
    "Indian wormwood.zip": "20",
    "Ivy Gourd.zip": "21",
    "Kokilaksha.zip": "22",
    "Land Caltrops (Bindii).zip": "23",
    "Madagascar Periwinkle.zip": "24",
    "Madras Pea Pumpkin.zip": "25",
    "Malabar Catmint.zip": "26",
    "Mexican Mint.zip": "27",
    "Mexican Prickly Poppy.zip": "28",
    "Mountain Knotgrass.zip": "29",
    "Nalta Jute.zip": "30",
    "Night blooming Cereus.zip": "31",
    "Panicled Foldwing.zip": "32",
    "Prickly Chaff Flower.zip": "33",
    "Punarnava.zip": "34",
    "Purple Fruited Pea Eggplant.zip": "35",
    "Purple Tephrosia.zip": "36",
    "Rosary Pea.zip": "37",
    "Shaggy button weed.zip": "38",
    "Small Water Clover.zip": "39",
    "Spiderwisp.zip": "40",
    "Square Stalked Vine.zip": "41",
    "Stinking Passionflower.zip": "42",
    "Sweet Basil.zip": "43",
    "Sweet flag.zip": "44",
    "Tinnevelly Senna.zip": "45",
    "Trellis Vine.zip": "46",
    "Velvet bean.zip": "47",
    "coatbuttons.zip": "48",
    "heart-leaved moonseed.zip": "49"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.33.0"
}
